Revit 2026 API

# LoadOperationType Enumeration

---

An enum indicating whether a resource load operation was triggered by a user action or an automatic process.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadOperationType
```
```vb
Public Enumeration LoadOperationType
```
```cpp
public enum class LoadOperationType
```
```fsharp
type LoadOperationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Automatic | 0 | The load operation was triggered automatically by another operation. |
| Explicit | 1 | The load operation was triggered by an explicit reload action on the part of the user. |

This enum is provided so that an external resource server can decide how much feedback it wishes to provide to the user.

For example, Revit automatically loads all resources on file open. This may cause many external resources to load at once. The server may wish to provide truncated error messages.

Reload() and LoadFrom() operations from the API are considered to be LoadOperationType.Explicit.

#### Reference

Autodesk.Revit.DB Namespace